"""Дано 20+ значное целое число, проверить его на делимость на 7
Ввод 234523642345789812354678654323454919865
Вывод Делится
"""

#number = input("Введите число: ")
number = 234523642345789812354678654323454919865
if number % 7 == 0:
  print("Делится")
else: 
  print("Не делится")